1yib.rust-bundle
akamud.vscode-theme-onedark
amiralizadeh9480.cpp-helper
antfu.browse-lite
dustypomerleau.rust-syntax
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot-chat
jeff-hykin.better-cpp-syntax
johnpapa.vscode-peacock
mcright.auto-save
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
oderwat.indent-rainbow
pkief.material-icon-theme
redhat.java
rust-lang.rust-analyzer
serayuzgur.crates
teabyii.ayu
visualstudiotoolsforunity.vstuc
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
